const LEGENDS_DB = [
    {
        name: "Jan_Abobbi",
        position: "Главный Администратор",
        period: "2023 — Наши дни",
        note: "Основатель системы тестирования. Запустил первый экзамен для курсантов на данном сайте. Виски с годами становится кратно лучше, как и он сам.",
        theme: "fire"
    },
    {
        name: "Maximiliano_Alwarez",
        position: "Офицер ВП",
        period: "2023 — 2026",
        note: "Активно участвовал в разработке и доработках устава МО/ВП. Внес огромный вклад в развитие ТСР.",
        theme: "fire"
    },
    {
        name: "Dobriy_Abobbi",
        position: "Куратор ВП",
        period: "2024 — Наши дни",
        note: "Сильнейший страх любого сотрудника МО. С ручкой и бумагой в руках, готов стереть любого с лица земли.",
        theme: "fire"
    },
    {
        name: "Chaffy_Washington",
        position: "Заместитель Куратора ВП",
        period: "2023 — Наши дни",
        note: "Показательный пример для всех сотрудников ВП. Годами показывает высочайший уровень профессионализма и ответственности в работе.",
        theme: "fire"
    },
    {
        name: "Ralph_Laurence",
        position: "Заместитель Куратора ВП",
        period: "2024 — Наши дни",
        note: "Долгожитель в рядах ВП. Пацифист и просто чиловый парень, который всегда готов помочь и поддержать любого сотрудника.",
        theme: "fire"
    },

    {
        name: "Killo_Adjika",
        position: "Куратора ВП",
        period: "2024 — 2025",
        note: "Самый загадочный Куратор ВП. Никто не знает, что он делал и чем занимаелся, но все знают, что он делал это очень хорошо.",
        theme: "fire"
    },

    {
        name: "Gustavo_Abobbi",
        position: "Куратора ВП",
        period: "2025 — 2026",
        note: "Один из самых страшных отчётных машин того времени. Никто не мог пройти мимо него, не получив отчёт. Весь отдел боялся его.",
        theme: "fire"
    },
];
