const LEGENDS_DB = [
    {
        name: "Jan_Abobbi",
        position: "Главный Администратор",
        period: "2025 — Наши дни",
        note: "Основатель системы тестирования. Запустил первый экзамен для курсантов на данном сайте."
    },
    {
        name: "Maximiliano_Alwarez",
        position: "Офицер ВП",
        period: "2025 — Наши дни",
        note: "Правая рука Главного Администратора. Активно учавствовал в разработке и доработках устава МО/ВП."
    },
    {
        name: "Akashi_Miyazuki",
        position: "Куратора ВП",
        period: "2025 — Наши дни",
        note: "Страшнейший страх любого сотрудника МО. С ручкой и бумагой в руках, готова стереть любого с лица земли."
    },
    {
        name: "Chaffy_Washington",
        position: "Заместитель Куратора ВП",
        period: "2026 — Наши дни",
        note: "Показательный пример для всех сотрудников ВП. Годами показывает высочайший уровень профессионализма и ответственности в работе."
    },
    {
        name: "Ralph_Laurence",
        position: "Заместитель Куратора ВП",
        period: "2026 — Наши дни",
        note: "Долгожитель в рядах ВП. Пацифист и просто чиловый парень, который всегда готов помочь и поддержать любого сотрудника."
    },
];
