const examQuestions = [
    { text: "Что обязаны знать и соблюдать сотрудники Военной полиции?", type: "multiple",
        options: [
            "Устав МО, Устав ВП",
            "Устав МЮ",
            "Федеральное постановление, уголовный кодекс, административный кодекс",
            "Всё выше перечисленное"
        ],
        correctAnswers: ["Устав МО, Устав ВП", "Федеральное постановление, уголовный кодекс, административный кодекс"],
        maxSelections: 2
    },
    { text: "Как должны разговаривать сотрудники военной полиции?", type: "text" },
    { text: "При каких условиях сотрудник ВП может покинуть свою ВЧ без формы в рабочее время?(Не с разрешения и не в обед)", type: "text" },
    { text: "Что должны иметь при себе сотрудники военной полиции при проверке ВЧ на ЧС?", type: "text" },
    { text: "Что должен делать сотрудник ВП при проверке ВЧ на ЧС, помимо самой проверки?", type: "text" },
    { text: "Что запрещается сотрудникам ВП при выполнении спец.задачи?", type: "text" },
    { text: "При каком приказе сотрудник ВП обязан снять маску?",
        type: "multiple",
        options: [
            "Приказ Министра Обороны",
            "Приказ Куратора Дельты",
            "Приказ Сотрудника Пра-во",
            "Приказ Руководста армии"
        ],
        correctAnswers: ["Приказ Министра Обороны", "Приказ Руководства армии"],
        maxSelections: 2
    },
    { text: "Какими цветами должен быть покрашен автомобиль сотрудника ВП?", type: "text" },
    { text: "Какая приписка в рации департамента?", type: "text" },
    { text: "Сколько минимум минут нужно проверять ВЧ на ЧС?", type: "multiple",
        options: [
            "4 минуты",
            "5 минут",
            "3 минуты",
            "Минимального лимита нет"
        ],
        correctAnswers: ["3 минуты"],
        maxSelections: 1
    },
    { text: "Кому подчиняются сотрудники ВП?", type: "text" },
    { text: "Последовательность действий офицера ВП при виде нарушителя?", type: "text" },
    { text: "Какие места помимо Военных Частей нужно проверять?", type: "text" },
    { text: "Назовите недельную норму проверок состава МО от ВП.", type: "multiple",
        options: [
            "7 раз в неделю",
            "3 раза в неделю",
            "5 раз в неделю",
            "4 раза в неделю"
        ],
        correctAnswers: ["3 раза в неделю"],
        maxSelections: 1
    },
    { text: "Какие последствия ждут организацию получившая неудовлетворительную оценку при проверке состава?", type: "text" },
];

const retrainingQuestions = [
    { text: "Что обязаны знать и соблюдать сотрудники Военной полиции?", type: "multiple",
        options: [
            "Устав МО, Устав ВП",
            "Устав МЮ",
            "Федеральное постановление, уголовный кодекс, административный кодекс",
            "Всё выше перечисленное"
        ],
        correctAnswers: ["Устав МО, Устав ВП", "Федеральное постановление, уголовный кодекс, административный кодекс"],
        maxSelections: 2
    },
    { text: "Как должны разговаривать сотрудники военной полиции?", type: "text" },
    { text: "При каких условиях сотрудник ВП может покинуть свою ВЧ без формы в рабочее время?(Не с разрешения и не в обед)", type: "text" },
    { text: "Что должны иметь при себе сотрудники военной полиции при проверке ВЧ на ЧС?", type: "text" },
    { text: "Что должен делать сотрудник ВП при проверке ВЧ на ЧС, помимо самой проверки?", type: "text" },
    { text: "Что запрещается сотрудникам ВП при выполнении спец.задачи?", type: "text" },
    { text: "При каком приказе сотрудник ВП обязан снять маску?",
        type: "multiple",
        options: [
            "Приказ Министра Обороны",
            "Приказ Куратора Дельты",
            "Приказ Сотрудника Пра-во",
            "Приказ Руководста армии"
        ],
        correctAnswers: ["Приказ Министра Обороны", "Приказ Руководства армии"],
        maxSelections: 2
    },
    { text: "Какими цветами должен быть покрашен автомобиль сотрудника ВП?", type: "text" },
    { text: "Какая приписка в рации департамента?", type: "text" },
    { text: "Сколько минимум минут нужно проверять ВЧ на ЧС?", type: "multiple",
        options: [
            "4 минуты",
            "5 минут",
            "3 минуты",
            "Минимального лимита нет"
        ],
        correctAnswers: ["3 минуты"],
        maxSelections: 1
    },
    { text: "Кому подчиняются сотрудники ВП?", type: "text" },
    { text: "Последовательность действий офицера ВП при виде нарушителя?", type: "text" },
    { text: "Какие места помимо Военных Частей нужно проверять?", type: "text" },
    { text: "Назовите недельную норму проверок состава МО от ВП.", type: "multiple",
        options: [
            "7 раз в неделю",
            "3 раза в неделю",
            "5 раз в неделю",
            "4 раза в неделю"
        ],
        correctAnswers: ["3 раза в неделю"],
        maxSelections: 1
    },
    { text: "Какие последствия ждут организацию получившая неудовлетворительную оценку при проверке состава?", type: "text" },
    { text: "В какое время запрещается делать проверку состава МО от ВП?", type: "text" },
    { text: "Назовите все критерии требующиеся для внесения личного транспортного средства в реестр.", type: "text" },
    { text: "Какие грузовые транспортные средства можно регистрировать в реестре?", type: "text" },
    { text: "Представим ситуацию, вы хотите заехать в СФа, стоите на КПП и видите как воруют маты в грузовом отсеке. Ваши действия?", type: "text" },
    { text: "Представим ситуацию, на Министра Обороны напали трое бандитов. Ваши действия?", type: "text" },
    { text: "У кого сотрудники ВП могут попросить помощи, ради поимки прогульщиков?", type: "text" },
    { text: "В каких случаях разрешается заехать на ВЧ без запроса?", type: "text" },
    { text: "Что грозит сотруднику ВП при распространения ответов из экзамена или её попытке?", type: "text" },
    { text: "Что грозит сотруднику ВП при трёхразовом провале экзамена?", type: "text" },
    { text: "В каких случаях разрешено заниматся надзорной деятельностью без формы?", type: "text" },
    { text: "Сколько времени даётся на прохождение переатестации?", type: "text" },
    { text: "В каких случаях Куратор ВП может потребовать пройти внеплановую переатестацию?", type: "text" },
];